petarivanov-msft/hivekit/sensors/scd40-c6/sdkconfig.defaults
# Zigbee end-device defaults for HiveKit SCD40
# Apply with: idf.py build (auto-merged with sdkconfig)

# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash size — XIAO ESP32-C6 has 4MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table (defines zb_storage / zb_fct / ota_0 / ota_1)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Zigbee role: End Device
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ED_ROLE=y
CONFIG_ZB_ZCZR_ROLE=n

# Zigbee NVS partitions (must match partitions.csv)
CONFIG_ZB_NVRAM_PARTITION="zb_storage"
CONFIG_ZB_NVRAM_FCT_PARTITION="zb_fct"

# Power management — DISABLED for Phase 1 first-join.
# v2 SDK has no equivalent of esp_zb_sleep_enable(); tickless idle fires during
# the 16-channel scan and causes missed beacons. Re-enable once joined and
# once we have proper v2 PM coordination.
# CONFIG_PM_ENABLE=y
# CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y

# Log level: INFO in production, DEBUG for development
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

# HiveKit Kconfig defaults (can be overridden in sdkconfig)
CONFIG_HIVEKIT_BUTTON_ENABLED=y
CONFIG_HIVEKIT_BUTTON_GPIO=9
CONFIG_HIVEKIT_BUTTON_LONG_PRESS_TIME_MS=3000
CONFIG_HIVEKIT_BUTTON_SHORT_PRESS_TIME_MS=100
CONFIG_HIVEKIT_LED_ENABLED=y
CONFIG_HIVEKIT_LED_GPIO=15
CONFIG_HIVEKIT_LED_ACTIVE_HIGH=y
CONFIG_HIVEKIT_SCD40_SDA_GPIO=22
CONFIG_HIVEKIT_SCD40_SCL_GPIO=23

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Sleep mode intentionally disabled for v0.3.3-beta baseline.
# Re-add CONFIG_IEEE802154_SLEEP_ENABLE + CONFIG_PM_ENABLE + esp_zb_sleep_enable()
# together in a future change once joined-state stability is proven.

# Disable Zigbee Green Power — frees scan budget, not used by Z2M anyway.
CONFIG_ZB_ENABLE_ZGP=n
